7767517
54 57
Input            modelInput               0 1 modelInput
Padding          53                       1 1 modelInput 53 0=0 1=0 2=0 3=0 4=2 5=0.000000e+00 7=0 8=0
Convolution      54                       1 1 53 54 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728
ReLU             55                       1 1 54 55 0=2.000000e-01
Convolution      56                       1 1 55 56 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             57                       1 1 56 57 0=2.000000e-01
Split            splitncnn_0              1 2 57 57_splitncnn_0 57_splitncnn_1
Padding          58                       1 1 57_splitncnn_1 58 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=0
Pooling          59                       1 1 58 59 0=1 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      60                       1 1 59 60 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             61                       1 1 60 61 0=2.000000e-01
Convolution      62                       1 1 61 62 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             63                       1 1 62 63 0=2.000000e-01
Split            splitncnn_1              1 2 63 63_splitncnn_0 63_splitncnn_1
Padding          64                       1 1 63_splitncnn_1 64 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=0
Pooling          65                       1 1 64 65 0=1 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      66                       1 1 65 66 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             67                       1 1 66 67 0=2.000000e-01
Convolution      68                       1 1 67 68 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             69                       1 1 68 69 0=2.000000e-01
Split            splitncnn_2              1 2 69 69_splitncnn_0 69_splitncnn_1
Padding          70                       1 1 69_splitncnn_1 70 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=0
Pooling          71                       1 1 70 71 0=1 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1 6=0
Convolution      72                       1 1 71 72 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             73                       1 1 72 73 0=2.000000e-01
Convolution      74                       1 1 73 74 0=512 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2359296
ReLU             75                       1 1 74 75 0=2.000000e-01
Deconvolution    76                       1 1 75 76 0=256 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=524288
Crop             81                       1 1 69_splitncnn_0 81 -23309=1,0 -23310=1,256 -23311=1,1
Crop             86                       1 1 81 86 -23309=1,0 -23310=1,256 -23311=1,2
Concat           87                       2 1 76 86 87 0=0
Convolution      88                       1 1 87 88 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1179648
ReLU             89                       1 1 88 89 0=2.000000e-01
Convolution      90                       1 1 89 90 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
ReLU             91                       1 1 90 91 0=2.000000e-01
Deconvolution    92                       1 1 91 92 0=128 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=131072
Crop             97                       1 1 63_splitncnn_0 97 -23309=1,0 -23310=1,512 -23311=1,1
Crop             102                      1 1 97 102 -23309=1,0 -23310=1,512 -23311=1,2
Concat           103                      2 1 92 102 103 0=0
Convolution      104                      1 1 103 104 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=294912
ReLU             105                      1 1 104 105 0=2.000000e-01
Convolution      106                      1 1 105 106 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
ReLU             107                      1 1 106 107 0=2.000000e-01
Deconvolution    108                      1 1 107 108 0=64 1=2 11=2 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=32768
Crop             113                      1 1 57_splitncnn_0 113 -23309=1,0 -23310=1,1024 -23311=1,1
Crop             118                      1 1 113 118 -23309=1,0 -23310=1,1024 -23311=1,2
Concat           119                      2 1 108 118 119 0=0
Convolution      120                      1 1 119 120 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=73728
ReLU             121                      1 1 120 121 0=2.000000e-01
Convolution      122                      1 1 121 122 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             123                      1 1 122 123 0=2.000000e-01
Convolution      124                      1 1 123 124 0=6 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456
Crop             129                      1 1 124 129 -23309=1,0 -23310=1,1024 -23311=1,1
Crop             modelOutput              1 1 129 modelOutput -23309=1,0 -23310=1,1024 -23311=1,2
